#lang sicp
#|
练习 1.10:以下步骤计算称为阿克曼函数的数学函数。

(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))
以下表达式的值是多少?

(A 1 10)
(A 2 4)
(A 3 3)
考虑以下过程,其中 A 是上面定义的过程:

(define (f n) (A 0 n))
(define (g n) (A 1 n))
(define (h n) (A 2 n))
(define (k n) (* 5 n n))
给出由过程 f 、 g 和 h 计算的函数的简明数学定义,其中 n
 为正整数值。例如, (k n) 计算 5n2
 。
答：
(f n) 计算 2n
(g n) 计算 2的n次方
(h n) 待定 下面的替代模型是底层的替换，反而会误导这里规律的总结
很明显，如果将中间层的抽象逻辑代入，具体指(h n)的定义本身和(g n)表示2的n次方，那么将有下面的推导过程：
(h n) = A(2 n) = A(1 (A 2 (n-1)))
=A(1 h(n-1)) = 2的h(n-1)次方，即(h n)表示2的h(n-1)次方，是幂塔

|#
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))
(define (f n) (A 0 n))
(define (g n) (A 1 n))
(define (h n) (A 2 n))
(define (k n) (* 5 n n))

(A 1 10)
(A 2 4)
(A 3 3)

;(g 2)
;(A 1 2)
;(A 0 (A 1 1))
;(A 0 2)
;(* 2 2)

;(g 3)
;(A 1 3)
;(A 0 (A 1 2))
;(A 0 (A 0 (A 1 1)))
;(A 0 (A 0 2))
;(A 0 4)
;(* 2 4)

(g 4)
(A 1 4)
(A 0 (A 1 3))
(A 0 (A 0 (A 1 2)))
(A 0 (A 0 (A 0 (A 1 1))))
(A 0 (A 0 (A 0 2)))
(A 0 (A 0 4))
(A 0 8)
(* 2 8)

(h 2)
(A 2 2)
(A 1 (A 2 1))
(A 1 2)
(A 0 (A 1 1))
(A 0 2)
(* 2 2)

(h 3)
(A 2 3)
(A 1 (A 2 2))
(A 1 (A 1 (A 2 1)))
(A 1 (A 1 2))
(A 1 (A 0 (A 1 1)))
(A 1 (A 0 2))
(A 1 4)
(A 0 (A 1 3))
(A 0 (A 0 (A 1 2)))
(A 0 (A 0 (A 0 (A 1 1))))
(A 0 (A 0 (A 0 2)))
(A 0 (A 0 4))
(A 0 8)
(* 2 8)

(h 4)
(A 2 4)
(A 1 (A 2 3))
(A 1 (A 1 (A 2 2)))
(A 1 (A 1 (A 1 (A 2 1))))
(A 1 (A 1 (A 1 2)))
(A 1 (A 1 (A 0 (A 1 1))))
(A 1 (A 1 (A 0 2)))
(A 1 (A 1 4))
(A 1 (A 0 (A 1 3)))
(A 1 (A 0 (A 0 (A 1 2))))
(A 1 (A 0 (A 0 (A 0 (A 1 1)))))
(A 1 (A 0 (A 0 (A 0 2))))
(A 1 (A 0 (A 0 4)))
(A 1 (A 0 8))
(A 1 16)
(A 0 (A 1 15))
(A 0 (A 0 (A 1 14)))
(A 0 (A 0 (A 0 (A 1 13))))
(A 0 (A 0 (A 0 (A 0 (A 1 12)))))

